app/controllers/goals_controller.rb

  def index
   @goal = Goal.where(id: current_user&.goal_id).map(&:name).first
---
SELECT "goals"."name" FROM "goals" WHERE "goals"."id" = $1  [["id", 1]]

  def create
    @goal = Goal.new(goal_params)
      if @goal.save
---
INSERT INTO "goals" ("name", "progress", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Ruby "], ["progress", 0], ["created_at", 2017-02-25 12:49:30 UTC], ["updated_at", 2017-02-25 12:49:30 UTC], ["description", "Learn Ruby"]]

    def set_goal
      @goal = Goal.find(params[:id])
---
SELECT  "goals".* FROM "goals" WHERE "goals"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]